### 🌊 Neptune Plan Results

**Terraform Stacks:** `apps/web, apps/web/ci-102-1, apps/web/ci-102-2`

**Neptune completed the plan with status:** ✅
> For more details, see the [GitHub Actions run](https://github.com/devopsfactory-io/neptune-tests/actions/runs/23422409486)

**Command ✅** `terragrunt init -upgrade` (stack: apps/web)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web] 05:10:51.830 INFO   Downloading Terraform configurations from ../../_modules/null-stack into ./.terragrunt-cache/6P9tidISWBB3QzlNzQtu-E3IDNE/wXSEdkNd5e5MY27MFN0bjqcoO98

stdout:
[apps/web] 05:10:52.007 STDOUT tofu: Initializing the backend...
05:10:52.190 STDOUT tofu: 
05:10:52.191 STDOUT tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:10:52.191 STDOUT tofu: use this backend unless the backend configuration changes.
05:10:52.296 STDOUT tofu: Initializing provider plugins...
05:10:52.296 STDOUT tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:10:52.356 STDOUT tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:10:52.426 STDOUT tofu: - Installing hashicorp/null v3.2.4...
05:10:52.596 STDOUT tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:10:52.641 STDOUT tofu: - Installing hashicorp/local v2.7.0...
05:10:52.825 STDOUT tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:10:52.825 STDOUT tofu: Providers are signed by their developers.
05:10:52.825 STDOUT tofu: If you'd like to know more about provider signing, you can read about it here:
05:10:52.826 STDOUT tofu: https://opentofu.org/docs/cli/plugins/signing/
05:10:52.826 STDOUT tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:10:52.826 STDOUT tofu: selections it made above. Include this file in your version control repository
05:10:52.826 STDOUT tofu: so that OpenTofu can guarantee to make the same selections by default when
05:10:52.826 STDOUT tofu: you run "tofu init" in the future.
05:10:52.826 STDOUT tofu: OpenTofu has been successfully initialized!
05:10:52.826 STDOUT tofu: 
05:10:52.826 STDOUT tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:10:52.826 STDOUT tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:10:52.826 STDOUT tofu: should now work.
05:10:52.826 STDOUT tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:10:52.826 STDOUT tofu: rerun this command to reinitialize your working directory. If you forget, other
05:10:52.826 STDOUT tofu: commands will detect it and remind you to do so if necessary.
```

</details>

**Command ✅** `terragrunt init -upgrade` (stack: apps/web/ci-102-1)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-102-1] 05:10:53.134 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/LjDMVE2jnA-r4KEPw1_3gHdJxtE/wXSEdkNd5e5MY27MFN0bjqcoO98

stdout:
[apps/web/ci-102-1] 05:10:53.279 STDOUT tofu: Initializing the backend...
05:10:53.428 STDOUT tofu: 
05:10:53.428 STDOUT tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:10:53.428 STDOUT tofu: use this backend unless the backend configuration changes.
05:10:53.495 STDOUT tofu: Initializing provider plugins...
05:10:53.495 STDOUT tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:10:53.541 STDOUT tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:10:53.603 STDOUT tofu: - Installing hashicorp/local v2.7.0...
05:10:53.784 STDOUT tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:10:53.840 STDOUT tofu: - Installing hashicorp/null v3.2.4...
05:10:54.003 STDOUT tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:10:54.003 STDOUT tofu: Providers are signed by their developers.
05:10:54.003 STDOUT tofu: If you'd like to know more about provider signing, you can read about it here:
05:10:54.003 STDOUT tofu: https://opentofu.org/docs/cli/plugins/signing/
05:10:54.003 STDOUT tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:10:54.003 STDOUT tofu: selections it made above. Include this file in your version control repository
05:10:54.003 STDOUT tofu: so that OpenTofu can guarantee to make the same selections by default when
05:10:54.004 STDOUT tofu: you run "tofu init" in the future.
05:10:54.004 STDOUT tofu: OpenTofu has been successfully initialized!
05:10:54.004 STDOUT tofu: 
05:10:54.004 STDOUT tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:10:54.004 STDOUT tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:10:54.004 STDOUT tofu: should now work.
05:10:54.004 STDOUT tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:10:54.004 STDOUT tofu: rerun this command to reinitialize your working directory. If you forget, other
05:10:54.004 STDOUT tofu: commands will detect it and remind you to do so if necessary.
```

</details>

**Command ✅** `terragrunt init -upgrade` (stack: apps/web/ci-102-2)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-102-2] 05:10:54.314 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/Yc3gcfg0bxbyefOz0IsZf6F6epE/wXSEdkNd5e5MY27MFN0bjqcoO98

stdout:
[apps/web/ci-102-2] 05:10:54.461 STDOUT tofu: Initializing the backend...
05:10:54.599 STDOUT tofu: 
05:10:54.599 STDOUT tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:10:54.599 STDOUT tofu: use this backend unless the backend configuration changes.
05:10:54.723 STDOUT tofu: Initializing provider plugins...
05:10:54.723 STDOUT tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:10:54.761 STDOUT tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:10:54.834 STDOUT tofu: - Installing hashicorp/local v2.7.0...
05:10:55.016 STDOUT tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:10:55.071 STDOUT tofu: - Installing hashicorp/null v3.2.4...
05:10:55.236 STDOUT tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:10:55.236 STDOUT tofu: Providers are signed by their developers.
05:10:55.236 STDOUT tofu: If you'd like to know more about provider signing, you can read about it here:
05:10:55.236 STDOUT tofu: https://opentofu.org/docs/cli/plugins/signing/
05:10:55.236 STDOUT tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:10:55.236 STDOUT tofu: selections it made above. Include this file in your version control repository
05:10:55.236 STDOUT tofu: so that OpenTofu can guarantee to make the same selections by default when
05:10:55.237 STDOUT tofu: you run "tofu init" in the future.
05:10:55.237 STDOUT tofu: OpenTofu has been successfully initialized!
05:10:55.237 STDOUT tofu: 
05:10:55.237 STDOUT tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:10:55.237 STDOUT tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:10:55.237 STDOUT tofu: should now work.
05:10:55.237 STDOUT tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:10:55.237 STDOUT tofu: rerun this command to reinitialize your working directory. If you forget, other
05:10:55.237 STDOUT tofu: commands will detect it and remind you to do so if necessary.
```

</details>

**Command ✅** `terragrunt plan` (stack: apps/web)
<details>
<summary>Click to see the command output</summary>

```
stderr:


stdout:
[apps/web] 05:10:56.111 STDOUT tofu: null_resource.stack: Refreshing state... [id=5873597553842205034]
05:10:56.112 STDOUT tofu: local_file.output: Refreshing state... [id=02b8a7d21d6e858cd56b387b18a7f09886438742]
05:10:56.122 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:10:56.122 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:10:56.122 STDOUT tofu:   + create
05:10:56.122 STDOUT tofu: OpenTofu will perform the following actions:
05:10:56.122 STDOUT tofu:   # local_file.output will be created
05:10:56.122 STDOUT tofu:   + resource "local_file" "output" {
05:10:56.122 STDOUT tofu:       + content              = "apps/web deployed"
05:10:56.122 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:10:56.122 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:10:56.123 STDOUT tofu:       + content_md5          = (known after apply)
05:10:56.123 STDOUT tofu:       + content_sha1         = (known after apply)
05:10:56.123 STDOUT tofu:       + content_sha256       = (known after apply)
05:10:56.123 STDOUT tofu:       + content_sha512       = (known after apply)
05:10:56.123 STDOUT tofu:       + directory_permission = "0777"
05:10:56.123 STDOUT tofu:       + file_permission      = "0777"
05:10:56.123 STDOUT tofu:       + filename             = "./output.txt"
05:10:56.123 STDOUT tofu:       + id                   = (known after apply)
05:10:56.123 STDOUT tofu:     }
05:10:56.123 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:10:56.123 STDOUT tofu: 
05:10:56.123 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
05:10:56.123 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
05:10:56.123 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

**Command ✅** `terragrunt plan` (stack: apps/web/ci-102-1)
<details>
<summary>Click to see the command output</summary>

```
stderr:


stdout:
[apps/web/ci-102-1] 05:10:56.985 STDOUT tofu: null_resource.stack: Refreshing state... [id=513367671554999496]
05:10:56.986 STDOUT tofu: local_file.output: Refreshing state... [id=1f4f63dac9cb80d65f6be29552c2cb03b26900f6]
05:10:56.997 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:10:56.997 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:10:56.997 STDOUT tofu:   + create
05:10:56.997 STDOUT tofu: OpenTofu will perform the following actions:
05:10:56.997 STDOUT tofu:   # local_file.output will be created
05:10:56.997 STDOUT tofu:   + resource "local_file" "output" {
05:10:56.997 STDOUT tofu:       + content              = "apps/web/ci-102-1 deployed"
05:10:56.997 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:10:56.997 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:10:56.997 STDOUT tofu:       + content_md5          = (known after apply)
05:10:56.998 STDOUT tofu:       + content_sha1         = (known after apply)
05:10:56.998 STDOUT tofu:       + content_sha256       = (known after apply)
05:10:56.998 STDOUT tofu:       + content_sha512       = (known after apply)
05:10:56.998 STDOUT tofu:       + directory_permission = "0777"
05:10:56.998 STDOUT tofu:       + file_permission      = "0777"
05:10:56.998 STDOUT tofu:       + filename             = "./output.txt"
05:10:56.998 STDOUT tofu:       + id                   = (known after apply)
05:10:56.998 STDOUT tofu:     }
05:10:56.998 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:10:56.998 STDOUT tofu: 
05:10:56.998 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
05:10:56.998 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
05:10:56.998 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>

**Command ✅** `terragrunt plan` (stack: apps/web/ci-102-2)
<details>
<summary>Click to see the command output</summary>

```
stderr:


stdout:
[apps/web/ci-102-2] 05:10:57.952 STDOUT tofu: null_resource.stack: Refreshing state... [id=2217601692384182174]
05:10:57.952 STDOUT tofu: local_file.output: Refreshing state... [id=bfc4796fd7ff08067e32d6c4b5782340cd83abe5]
05:10:57.961 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:10:57.961 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:10:57.962 STDOUT tofu:   + create
05:10:57.962 STDOUT tofu: OpenTofu will perform the following actions:
05:10:57.962 STDOUT tofu:   # local_file.output will be created
05:10:57.962 STDOUT tofu:   + resource "local_file" "output" {
05:10:57.962 STDOUT tofu:       + content              = "apps/web/ci-102-2 deployed"
05:10:57.962 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:10:57.962 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:10:57.962 STDOUT tofu:       + content_md5          = (known after apply)
05:10:57.962 STDOUT tofu:       + content_sha1         = (known after apply)
05:10:57.962 STDOUT tofu:       + content_sha256       = (known after apply)
05:10:57.962 STDOUT tofu:       + content_sha512       = (known after apply)
05:10:57.962 STDOUT tofu:       + directory_permission = "0777"
05:10:57.962 STDOUT tofu:       + file_permission      = "0777"
05:10:57.962 STDOUT tofu:       + filename             = "./output.txt"
05:10:57.962 STDOUT tofu:       + id                   = (known after apply)
05:10:57.962 STDOUT tofu:     }
05:10:57.962 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:10:57.962 STDOUT tofu: 
05:10:57.962 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
05:10:57.963 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
05:10:57.963 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

</details>


To apply these changes, comment:
```
@neptbot apply
```
